# 1 Region and Domain

## State the region and the domain category that your data sets are about.

Ann Arbor, Michigan, United States
Religious events or traditions

# 2 Research Question
## You must state a question about the domain category and region that you identified as being interesting.
The date of Easter varies year to year.  What is the variation in maximum and minimum temperature that has taken place in the years XXXX and XXXX?  Is there a noticible difference in temparature for Easters that have taken place earlier in the year compared with later in the year?

# 3 Links
## You must provide at least two links to publicly accessible datasets. These could be links to files such as CSV or Excel files, or links to websites which might have data in tabular form, such as Wikipedia pages.
http://tlarsen2.tripod.com/thomaslarsen/easterdates.html 
https://www.ncdc.noaa.gov  
Data request at ncdc.noaa.gov was the following parameters:  
REQUESTED DATA REVIEW  
Dataset	Daily Summaries  
Order Start Date	2000-01-01 00:00  
Order End Date	2015-08-01 23:59  
Output Format	Custom GHCN-Daily CSV  
Data Types	TAVG, TMAX, TMIN, TOBS  
Custom Flag(s)	Station Name  
Units	Standard  
Stations/Locations	Ann Arbor, MI US (Location ID: CITY:US260002)

# 4 Image
## You must upload an image which addresses the research question you stated. In addition to addressing the question, this visual should follow Cairoâ€™s principles of truthfulness, functionality, beauty, and insightfulness.

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib notebook

# bring in data
temps = pd.read_csv('1444729.csv')

In [52]:
#df = pd.read_fwf('output_list.txt')
df2 = pd.read_fwf('easter_dates_2000.txt', [(0, 15)], header=None)
df2['date'] = df2[0].map(lambda x: pd.to_datetime(x))
temps['date_dt'] = temps['DATE'].map(lambda x: pd.to_datetime(x))

In [30]:
df2.head()

                 0       date
0  23rd April 2000 2000-04-23
1  15th April 2001 2001-04-15
2  31st March 2002 2002-03-31
3  20th April 2003 2003-04-20
4  11th April 2004 2004-04-11

# 5 Discussion
## You must contribute a short (1-2 paragraph) written justification of how your visualization addresses your stated research question.

In [36]:
easter_list

[Timestamp('2000-04-23 00:00:00'),
 Timestamp('2001-04-15 00:00:00'),
 Timestamp('2002-03-31 00:00:00'),
 Timestamp('2003-04-20 00:00:00'),
 Timestamp('2004-04-11 00:00:00'),
 Timestamp('2005-03-27 00:00:00'),
 Timestamp('2006-04-16 00:00:00'),
 Timestamp('2007-04-08 00:00:00'),
 Timestamp('2008-03-23 00:00:00'),
 Timestamp('2009-04-12 00:00:00'),
 Timestamp('2010-04-04 00:00:00'),
 Timestamp('2011-04-24 00:00:00'),
 Timestamp('2012-04-08 00:00:00'),
 Timestamp('2013-03-31 00:00:00'),
 Timestamp('2014-04-20 00:00:00'),
 Timestamp('2015-04-05 00:00:00'),
 Timestamp('2016-03-27 00:00:00'),
 Timestamp('2017-04-16 00:00:00'),
 Timestamp('2018-04-01 00:00:00'),
 Timestamp('2019-04-21 00:00:00'),
 Timestamp('2020-04-12 00:00:00'),
 Timestamp('2021-04-04 00:00:00'),
 Timestamp('2022-04-17 00:00:00'),
 Timestamp('2023-04-09 00:00:00'),
 Timestamp('2024-03-31 00:00:00')]

In [53]:
temps2 = temps[temps['date_dt'].isin(df2['date'])]

In [51]:
type(temps['DATE'][0])

str

In [54]:
temps2.shape

(129, 8)

In [55]:
temps2.head(10)

,STATION,NAME,DATE,TAVG,TMAX,TMIN,TOBS,date_dt
113,USC00200230,"ANN ARBOR U OF MICH, MI US",2000-04-23,NaN,65.0,37.0,62.0,2000-04-23
470,USC00200230,"ANN ARBOR U OF MICH, MI US",2001-04-15,NaN,61.0,38.0,42.0,2001-04-15
820,USC00200230,"ANN ARBOR U OF MICH, MI US",2002-03-31,NaN,54.0,33.0,49.0,2002-03-31
1205,USC00200230,"ANN ARBOR U OF MICH, MI US",2003-04-20,NaN,73.0,56.0,60.0,2003-04-20
1562,USC00200230,"ANN ARBOR U OF MICH, MI US",2004-04-11,NaN,49.0,34.0,45.0,2004-04-11
1912,USC00200230,"ANN ARBOR U OF MICH, MI US",2005-03-27,NaN,48.0,30.0,45.0,2005-03-27
2297,USC00200230,"ANN ARBOR U OF MICH, MI US",2006-04-16,NaN,68.0,41.0,56.0,2006-04-16
2654,USC00200230,"ANN ARBOR U OF MICH, MI US",2007-04-08,NaN,34.0,23.0,33.0,2007-04-08
3004,USC00200230,"ANN ARBOR U OF MICH, MI US",2008-03-23,NaN,41.0,20.0,37.0,2008-03-23
3389,USC00200230,"ANN ARBOR U OF MICH, MI US",2009-04-12,NaN,53.0,27.0,50.0,2009-04-12